CommunityGD32Cores/gd32-pio-spl-package/gd32/spl/variants/gd32a50x/inc/gd32a50x_mfcom.h
/* MFCOM_SCFGx */
#define MFCOM_SCFG_SSTART               BITS(0,1)                                /*!< shifter start bit */
#define MFCOM_SCFG_SSTOP                BITS(4,5)                                /*!< shifter stop bit */
#define MFCOM_SCFG_INSRC                BIT(8)                                   /*!< input source */

/* MFCOM_SBUFx */
#define MFCOM_SBUFx_SBUF                BITS(0,31)                               /*!< shift buffer */

/* MFCOM_SBUFBISx */
#define MFCOM_SBUFBISx_SBUFBIS          BITS(0,31)                               /*!< shift buffer bit swapped */

/* MFCOM_SBUFBYSx */
#define MFCOM_SBUFBYSx_SBUFBYS          BITS(0,31)                               /*!< shift buffer byte swapped */

/* MFCOM_SBUFBBSx */
#define MFCOM_SBUFBBSx_SBUFBBS          BITS(0,31)                               /*!< shift buffer bit byte swapped */

/* MFCOM_TMCTLx */
#define MFCOM_TMCTL_TMMOD               BITS(0,1)                                /*!< timer mode */
#define MFCOM_TMCTL_TMPPL               BIT(7)                                   /*!< timer pin polarity */
#define MFCOM_TMCTL_TMPSEL              BITS(8,10)                               /*!< timer pin select */
#define MFCOM_TMCTL_TMPCFG              BITS(16,17)                              /*!< timer pin configuration */
#define MFCOM_TMCTL_TRIGSRC             BIT(22)                                  /*!< trigger source */
#define MFCOM_TMCTL_TRIGPL              BIT(23)                                  /*!< trigger polarity */
#define MFCOM_TMCTL_TRIGSEL             BITS(24,27)                              /*!< trigger select */

/* MFCOM_TMCFGx */
#define MFCOM_TMCFG_TMSTART             BIT(1)                                   /*!< timer start bit */
#define MFCOM_TMCFG_TMSTOP              BITS(4,5)                                /*!< timer stop bit */
#define MFCOM_TMCFG_TMEN                BITS(8,10)                               /*!< timer enable source */
#define MFCOM_TMCFG_TMDIS               BITS(12,14)                              /*!< timer disable source */
#define MFCOM_TMCFG_TMRST               BITS(16,18)                              /*!< timer reset source */
#define MFCOM_TMCFG_TMDEC               BITS(20,21)                              /*!< timer decrement source */
#define MFCOM_TMCFG_TMOUT               BITS(24,25)                              /*!< timer output select */

/* MFCOM_TMCMPx */
#define MFCOM_TMCMPx_TMCVALUE           BITS(0,31)                               /*!< timer compare value */

/* constants definitions */
/* MFCOM timer init parameter struct definitions */
typedef struct
{
    /* trigger */
    uint32_t trigger_select;                                                    /*!< the internal trigger selection */
    uint32_t trigger_polarity;                                                  /*!< trigger polarity */
    /* pin */
    uint32_t pin_config;                                                        /*!< timer pin configuration */
    uint32_t pin_select;                                                        /*!< timer pin number select */
    uint32_t pin_polarity;                                                      /*!< timer pin polarity */
    /* timer */
    uint32_t mode;                                                              /*!< timer work mode */
    uint32_t output;                                                            /*!< configures the initial state of the timer output and
                                                                                whether it is affected by the timer reset */
    uint32_t decrement;                                                         /*!< configures the source of the timer decrement and the
                                                                                source of the shift clock */
    uint32_t reset;                                                             /*!< configures the condition that causes the timer counter
                                                                                (and optionally the timer output) to be reset */
    uint32_t disable;                                                           /*!< configures the condition that causes the timer to be
                                                                                disabled and stop decrementing */
    uint32_t enable;                                                            /*!< configures the condition that causes the timer to be
                                                                                enabled and start decrementing */
    uint32_t stopbit;                                                           /*!< timer stop bit generation */
    uint32_t startbit;                                                          /*!< timer start bit generation */
    uint32_t compare;                                                           /*!< value for timer compare x register */
}mfcom_timer_parameter_struct;

/* MFCOM shifter init parameter struct definitions */
typedef struct
{
    /* timer */
    uint32_t timer_select;                                                      /*!< selects which timer is used for controlling the
                                                                                logic/shift register and generating the shift clock */
    uint32_t timer_polarity;                                                    /*!< timer polarity */
    /* pin */
    uint32_t pin_config;                                                        /*!< shifter pin configuration */
    uint32_t pin_select;                                                        /*!< shifter pin number select */
    uint32_t pin_polarity;                                                      /*!< shifter pin polarity */
    /* shifter */
    uint32_t mode;                                                              /*!< configures the mode of the shifter */
    uint32_t input_source;                                                      /*!< selects the input source for the shifter */
    uint32_t stopbit;                                                           /*!< shifter stop bit */
    uint32_t startbit;                                                          /*!< shifter start bit */
}mfcom_shifter_parameter_struct;

/* MFCOM timer trigger source */
#define TMCTL_TRIGSEL(regval)                    (BITS(24,27) & ((uint32_t)(regval) << 24U))
#define MFCOM_TIMER_TRGSEL_PIN0                  (TMCTL_TRIGSEL(0)|MFCOM_TMCTL_TRIGSRC)                 /*!< pin 0 input selected */
#define MFCOM_TIMER_TRGSEL_SHIFTER0              (TMCTL_TRIGSEL(1)|MFCOM_TMCTL_TRIGSRC)                 /*!< shifter 0 status flag selected */
#define MFCOM_TIMER_TRGSEL_PIN1                  (TMCTL_TRIGSEL(2)|MFCOM_TMCTL_TRIGSRC)                 /*!< pin 1 selected */
#define MFCOM_TIMER_TRGSEL_TIMER0                (TMCTL_TRIGSEL(3)|MFCOM_TMCTL_TRIGSRC)                 /*!< timer 0 trigger output selected */
#define MFCOM_TIMER_TRGSEL_PIN2                  (TMCTL_TRIGSEL(4)|MFCOM_TMCTL_TRIGSRC)                 /*!< pin 2 selected */
#define MFCOM_TIMER_TRGSEL_SHIFTER1              (TMCTL_TRIGSEL(5)|MFCOM_TMCTL_TRIGSRC)                 /*!< shifter 1 status flag selected */
#define MFCOM_TIMER_TRGSEL_PIN3                  (TMCTL_TRIGSEL(6)|MFCOM_TMCTL_TRIGSRC)                 /*!< pin 3 selected */
#define MFCOM_TIMER_TRGSEL_TIMER1                (TMCTL_TRIGSEL(7)|MFCOM_TMCTL_TRIGSRC)                 /*!< timer 1 trigger output selected */
#define MFCOM_TIMER_TRGSEL_PIN4                  (TMCTL_TRIGSEL(8)|MFCOM_TMCTL_TRIGSRC)                 /*!< pin 4 selected */
#define MFCOM_TIMER_TRGSEL_SHIFTER2              (TMCTL_TRIGSEL(9)|MFCOM_TMCTL_TRIGSRC)                 /*!< shifter 2 status flag selected */
#define MFCOM_TIMER_TRGSEL_PIN5                  (TMCTL_TRIGSEL(10)|MFCOM_TMCTL_TRIGSRC)                /*!< pin 5 selected */
#define MFCOM_TIMER_TRGSEL_TIMER2                (TMCTL_TRIGSEL(11)|MFCOM_TMCTL_TRIGSRC)                /*!< timer 2 trigger output selected */
#define MFCOM_TIMER_TRGSEL_PIN6                  (TMCTL_TRIGSEL(12)|MFCOM_TMCTL_TRIGSRC)                /*!< pin 6 selected */
#define MFCOM_TIMER_TRGSEL_SHIFTER3              (TMCTL_TRIGSEL(13)|MFCOM_TMCTL_TRIGSRC)                /*!< shifter 3 status flag selected */
#define MFCOM_TIMER_TRGSEL_PIN7                  (TMCTL_TRIGSEL(14)|MFCOM_TMCTL_TRIGSRC)                /*!< pin 7 selected */
#define MFCOM_TIMER_TRGSEL_TIMER3                (TMCTL_TRIGSEL(15)|MFCOM_TMCTL_TRIGSRC)                /*!< timer 3 trigger output selected */
#define MFCOM_TIMER_TRGSEL_EXTERNAL0             TMCTL_TRIGSEL(0)                                       /*!< external trigger0 selected */
#define MFCOM_TIMER_TRGSEL_EXTERNAL1             TMCTL_TRIGSEL(1)                                       /*!< external trigger1 selected */
#define MFCOM_TIMER_TRGSEL_EXTERNAL2             TMCTL_TRIGSEL(2)                                       /*!< external trigger2 selected */
#define MFCOM_TIMER_TRGSEL_EXTERNAL3             TMCTL_TRIGSEL(3)                                       /*!< external trigger3 selected */

